Repository: ist-zpi-vivid-panda/Vivid-panda
Catalog: backend/translations/*/LC_MESSAGES/messages.po
Languages: pl

source: Image size for %(ai_func)s must be between %(min_size)s and %(max_size)s pixels
pl: Wielkość obrazka dla %(ai_func)s musi być pomiędzy %(min_size)s a %(max_size)s pikselami

source: Email already registered
pl: Adres email już zarejestrowany

source: Invalid username or password
pl: Nieprawidłowy email lub hasło

source: Account already exists for another provider
pl: Konto istnieje dla innego dostawcy

source: User does not exists
pl: Użytkownik nie istnieje

source: Cannot reset password for this account provider
pl: Nie można zresetować hasła dla tego dostawcy

source: Missing data
pl: Brak danych

source: Token expired
pl: Token przestarzały

source: Passwords are not the same
pl: Hasła są rózne

source: Passwords cannot be the same as previous password
pl: Hasło musi być inne od poprzedniego

source: User email not available or not verified by Google
pl: Adres email niedostępny lub niezweryfikowany przez Google

source: Incorrect user
pl: Niepoprawny użytkownik

source: File doesn't exist
pl: Plik nie istnieje

source: File not saved
pl: Plik nie został zapisany

source: Unable to retrieve file size
pl: Nie udało się zczytać wielkości pliku

source: Maximum number of files you can upload is %(max_files)s or %(max_mb)s MB
pl: Maksymalna liczba plików, które możesz wgrać to %(max_files)s or %(max_mb)s MB

source: File info not saved
pl: Dane pliku nie zostały zapisane

source: File wasn't deleted
pl: Plik nie został usunięty

source: File not updated
pl: Plik nie zaktualizowany

source: Couldn't update file
pl: Nie można było zaktualizować pliku

source: File data doesn't exist
pl: Dane pliku nie istnieją

source: Password is required
pl: Hasło jest wymagane

source: Username is required
pl: Nazwa użytkownika jest wymagana

source: Access token is required
pl: Token dostępu jest wymagany

source: Refresh token is required
pl: Token odświeżający jest wymagany

source: File of type %(ext)s up to %(length)s B
pl: Plik typu $(ext)s do $(length)s B

source: File is required
pl: Plik jest wymagany

source: File size must not exceed %(length)s B
pl: Wielkość pliku nie może przekraczać $(length)s B

source: No file name detected
pl: Nie znaleziono nazwy pliku

source: Invalid file extension. Only %(ext)s are allowed
pl: Nieprawidłowe rozszerzenie pliku. Jedynie %(ext)s są dozwolone

source: No MIME type detected. Please upload a valid file
pl: Brak typu MIME. Proszę wgrać poprawny plik

source: Invalid MIME type. Only %(formats)s are allowed
pl: Nieprawidłowy typ MIME. Jedynie %(formats)s są dozwolone

source: Filename is required
pl: Nazwa pliku jest wymagana

source: Invalid filename format
pl: Nieprawidłowy format pliku

source: File ID is required
pl: ID pliku jest wymagane

source: Invalid file ID format
pl: Nieprawidłowy format ID pliku

source: MIME type is required
pl: Typ MIME jest wymagany

source: Invalid MIME type format
pl: Nieprawidłowy typ MIME

source: File size is required
pl: Rozmiar pliku jest wymagany

source: File size must be an integer
pl: Rozmiar pliku musi być liczbą całkowitą

source: Upload date is required
pl: Data wgrania jest wymagana

source: Invalid date format
pl: Nieprawidłowy format daty

source: Last update date is required
pl: Data ostatniej aktualizacji jest wymagana

source: Owner ID is required
pl: ID właściciela jest wymagane

source: Invalid owner ID format
pl: Nieprawidłowy format ID właściciela

source: Invalid thumbnail format
pl: Nieprawidłowy format miniaturki

source: File collection is required
pl: Kolekcja plików jest wymagana

source: Invalid format for file collection
pl: Nieprawidłowy format kolekcji plików

source: File path is required
pl: Ścieżka pliku jest wymagana

source: Invalid file path format
pl: Nieprawidłowy format ścieżki pliku

source: File name is required
pl: Nazwa pliku jest wymagana

source: Invalid file name format
pl: Nieprawidłowy format pliku

source: Invalid mask file format
pl: Nieprawidłowy format maski

source: Password must be at least 8 characters long, with at least one uppercase letter, one lowercase letter, and one digit
pl: Hasło musi mieć co najmniej 8 znaków, w tym co najmniej jedną wielką literę, jedną małą literę i jedną cyfrę

source: Invalid email address format
pl: Niepoprawny format adresu email

source: Email is required
pl: Adres email jest wymagany

source: Collection is required
pl: Kolekcja jest wymagana

source: Invalid format for collection
pl: Nieprawidłowy format kolekcji

source: Page number is required
pl: Numer strony jest wymagany

source: Page number must be an integer
pl: Numer strony musi być liczbą całkowitą

source: Total pages are required
pl: Całkowita liczba stron jest wymagana

source: Total pages must be an integer
pl: Całkowita liczba stron musi być liczbą całkowitą

source: Total items count is required
pl: Całkowita liczba elementów jest wymagana

source: Total items must be an integer
pl: Całkowita liczba elementów musi być liczbą całkowitą

source: Error message is required
pl: Wiadomość błędu jest wymagana

source: Invalid error message format
pl: Nieprawidłowy format wiadomości błędu

source: Validation errors are required
pl: Błędy walidacji są wymagane

source: Invalid format for validation errors
pl: Nieprawidłowy format błędów walidacji

source: Success status is required
pl: Status sukcesu jest wymagany

source: Success status must be a boolean value
pl: Status sukcesu musi mieć wartość bool'owską

source: User ID is required
pl: ID użytkownika jest wymagane

source: Invalid User ID format
pl: Nieprawidłowy format ID użytkownika

source: Invalid username format
pl: Nieprawidłowy format nazwy użytkownika

source: Invalid provider. Accepted values are: %(provider)s
pl: Nieprawidłowy dostawca. Akceptowane wartości to: %(provider)s

source: Invalid profile picture data format
pl: Nieprawidłowy format danych obrazka
